{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "class_weights": [
    0.4922839403152466,
    1.1507936716079712,
    2.0931758880615234,
    1.5918164253234863,
    0.5881268382072449,
    3.4081196784973145
  ],
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "BENIGN",
    "1": "DoS GoldenEye",
    "2": "DoS Slowhttptest",
    "3": "FTP-Patator",
    "4": "PortScan",
    "5": "SSH-Patator"
  },
  "initializer_range": 0.02,
  "label2id": {
    "BENIGN": 0,
    "DoS GoldenEye": 1,
    "DoS Slowhttptest": 2,
    "FTP-Patator": 3,
    "PortScan": 4,
    "SSH-Patator": 5
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "task_specific_params": {
    "cybersecurity_classification": {
      "created_with": "CyberBERT Trainer",
      "hardware": "CPU: AMD64 Family 23 Model 104 Stepping 1, AuthenticAMD",
      "num_labels": 6,
      "training_data": "clean_data.csv",
      "training_date": "2025-04-11 19:09:30"
    }
  },
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.51.2",
  "vocab_size": 30522
}
